app/controllers/articles_controller.rb

def update
	@article = Article.find(params[:id])
	@article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["image_content_type", "image/jpeg"], ["image_file_name", "fish.jpg"], ["image_file_size", 5154], ["image_updated_at", "2014-11-13 04:42:42.561397"], ["updated_at", "2014-11-13 04:42:43.320203"]]